app/controllers/image_galleries_controller.rb

SELECT "image_galleries".* FROM "image_galleries"
---
  def index
    @image_gallery = ImageGallery.all

SELECT  "image_galleries".* FROM "image_galleries" WHERE "image_galleries"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @image_gallery = ImageGallery.find(params[:id])